[
  {
    "image": "/chatapp.png",
    "title": "ChatSphere - Modern Messaging App",
    "companyName": "BrightSoft",
    "id": 1,
    "description": "ChatSphere is a next-generation messaging platform built for seamless communication across devices. It supports text, voice, and high-definition video chats with ultra-low latency. Users can create groups, share files, send media, and even use fun stickers or custom themes to personalize conversations. With real-time syncing, messages stay updated on all devices instantly. End-to-end encryption ensures complete privacy and data protection, while smart notifications keep you connected without interruptions. ChatSphere is perfect for both casual chats and professional collaboration.",
    "size": 35,
    "reviews": "12K",
    "ratingAvg": 4.3,
    "downloads": "500K",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "/fitness-tracking-app.webp",
    "title": "FitBuddy - Personal Fitness Tracker",
    "companyName": "ActiveLife Co.",
    "id": 2,
    "description": "FitBuddy transforms your fitness journey into a personalized, data-driven experience. Track workouts, calories, and daily steps with precision. The app generates custom training plans based on your goals and progress. It visualizes your achievements with charts and progress bars, helping you stay motivated. Integration with smartwatches and wearables provides real-time performance tracking. Join community challenges, earn badges, and connect with other fitness enthusiasts. FitBuddy is your ultimate fitness partner to stay healthy and consistent.",
    "size": 52,
    "reviews": "18K",
    "ratingAvg": 4.6,
    "downloads": "1.1M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 9500 }
    ]
  },
  {
    "image": "/online-learning.webp",
    "title": "EduVerse - Online Learning Platform",
    "companyName": "NextLearn",
    "id": 3,
    "description": "EduVerse is an interactive e-learning ecosystem that makes education accessible and engaging for everyone. Explore thousands of courses across multiple disciplines with lessons created by expert instructors. Each course includes quizzes, notes, and progress tracking dashboards. Learners can join live sessions or study offline at their own pace. EduVerse’s AI recommendations help you discover new skills aligned with your career path. Whether you’re a student or a professional, EduVerse empowers lifelong learning with structure and motivation.",
    "size": 48,
    "reviews": "23K",
    "ratingAvg": 4.5,
    "downloads": "800K",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1400 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 9100 }
    ]
  },
  {
    "image": "/food-delivery.webp",
    "title": "QuickEats - Food Delivery & Deals",
    "companyName": "FoodNext",
    "id": 4,
    "description": "QuickEats delivers your favorite meals faster than ever before with live tracking and personalized restaurant recommendations. Browse thousands of local restaurants, filter by cuisine or rating, and place orders in seconds. The app’s smart system predicts delivery times accurately, ensuring reliability. Users can customize dishes, save favorites, and enjoy exclusive offers and promo codes. With secure payments and 24/7 customer support, QuickEats ensures a smooth, convenient, and delightful food delivery experience every time.",
    "size": 29,
    "reviews": "45K",
    "ratingAvg": 4.2,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 2800 },
      { "name": "2 star", "count": 3600 },
      { "name": "3 star", "count": 7200 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 19400 }
    ]
  },
  {
    "image": "/daily-planner.webp",
    "title": "NoteHive - Smart Notes & Tasks",
    "companyName": "Productive Apps",
    "id": 5,
    "description": "NoteHive is your digital workspace for capturing ideas, organizing thoughts, and managing projects efficiently. Create notes, to-do lists, and reminders with a clean, distraction-free interface. Categorize content with tags, folders, and color coding for quick retrieval. Sync your notes across all devices and access them even offline. Collaborate with teams by sharing projects in real time. Smart search and AI-assisted suggestions make productivity effortless. NoteHive is built for students, professionals, and creators who value organization and focus.",
    "size": 21,
    "reviews": "8.7K",
    "ratingAvg": 4.7,
    "downloads": "350K",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 3800 }
    ]
  },
  {
    "image": "/fun-games.jpg",
    "title": "GameZone - Fun Mini Games",
    "companyName": "PlayHub",
    "id": 6,
    "description": "GameZone is a fun-packed collection of mini-games designed to entertain players of all ages. From puzzles and logic challenges to fast-paced action games, it offers something for everyone. Compete against AI or friends online and climb global leaderboards. Each game includes achievements, unlockables, and daily rewards to keep you coming back. Enjoy smooth performance and intuitive controls even on low-end devices. GameZone combines simplicity and excitement, making it your all-in-one mobile gaming hub.",
    "size": 95,
    "reviews": "29K",
    "ratingAvg": 4.1,
    "downloads": "1.6M",
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 8000 }
    ]
  },
  {
    "image": "/traveller.webp",
    "title": "TravelWise - Smart Travel Guide",
    "companyName": "Global Journeys",
    "id": 7,
    "description": "TravelWise is your personal travel planner and guide, designed to make every journey hassle-free. Discover top destinations, book hotels, and plan itineraries all in one app. Use interactive maps, expense tracking, and smart recommendations to explore with confidence. You can save favorite places, create custom trip plans, and share them with friends. The app provides local tips, language assistance, and safety alerts. TravelWise ensures that whether you’re backpacking or on a luxury trip, your adventures stay organized and memorable.",
    "size": 68,
    "reviews": "16.5K",
    "ratingAvg": 4.4,
    "downloads": "950K",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6500 }
    ]
  },
  {
    "image": "/smart-shopping.jpeg",
    "title": "ShopWave - Smart Shopping Deals",
    "companyName": "EcomNext",
    "id": 8,
    "description": "ShopWave revolutionizes your shopping experience by helping you find the best deals across multiple online stores. Compare prices, read verified reviews, and track discounts effortlessly. Its AI-powered engine suggests personalized offers based on your interests and browsing history. Save your favorite products and get notified when prices drop. ShopWave also features smart wishlists and secure shopping links. Whether you’re buying tech gadgets, clothes, or groceries, ShopWave ensures you save money while shopping smarter.",
    "size": 55,
    "reviews": "21K",
    "ratingAvg": 4.3,
    "downloads": "1.4M",
    "ratings": [
      { "name": "1 star", "count": 1300 },
      { "name": "2 star", "count": 1600 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 9900 }
    ]
  },
  {
    "image": "/expense-tracker.png",
    "title": "MoneyMate - Expense & Budget Tracker",
    "companyName": "FinPro",
    "id": 9,
    "description": "MoneyMate is your all-in-one financial assistant for smart budgeting and expense tracking. Record income and expenses effortlessly, categorize spending, and get visual insights through graphs and summaries. Set monthly budgets, savings goals, and bill reminders to stay financially disciplined. The app analyzes your habits and provides personalized advice for better money management. Export data into spreadsheets for detailed reporting. With a secure, user-friendly interface, MoneyMate empowers you to take full control of your financial future.",
    "size": 32,
    "reviews": "19.2K",
    "ratingAvg": 4.6,
    "downloads": "870K",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 4400 },
      { "name": "5 star", "count": 9300 }
    ]
  },
  {
    "image": "/play-music.png",
    "title": "TuneBox - Music & Playlists",
    "companyName": "Soundify",
    "id": 10,
    "description": "TuneBox is a premium music streaming platform that gives you access to millions of songs and playlists. Enjoy your favorite tracks offline or online with high-quality sound. TuneBox’s AI learns your taste to create personalized mixes and discover new artists. Users can create and share playlists, follow trending charts, and explore podcasts. The sleek interface and low-buffer playback ensure an uninterrupted experience. Whether you love pop, rock, or jazz, TuneBox brings music to life like never before.",
    "size": 74,
    "reviews": "43K",
    "ratingAvg": 4.2,
    "downloads": "3.2M",
    "ratings": [
      { "name": "1 star", "count": 2800 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 17200 }
    ]
  },
  {
    "image": "/meditation.png",
    "title": "MindSpace - Meditation & Relaxation",
    "companyName": "CalmTech",
    "id": 11,
    "description": "MindSpace helps you manage stress and mental well-being through guided meditation and mindfulness practices. Explore a wide range of audio sessions, breathing techniques, and sleep soundscapes. Track your daily progress and build a personalized meditation habit. The app adapts to your needs — from quick relaxation breaks to deep sleep guidance. Notifications gently remind you to take mindful moments throughout your day. MindSpace is your peaceful pocket companion for focus, calm, and emotional balance.",
    "size": 40,
    "reviews": "15.5K",
    "ratingAvg": 4.7,
    "downloads": "620K",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 8800 }
    ]
  },
  {
    "image": "/meal-planner.png",
    "title": "CookSmart - Recipes & Meal Planner",
    "companyName": "FoodieTech",
    "id": 12,
    "description": "CookSmart brings the joy back into cooking by simplifying meal planning and recipe management. Explore thousands of step-by-step recipes with detailed ingredient lists and nutritional info. Create shopping lists automatically and plan weekly menus. Save your favorite dishes and share them with friends. The app also suggests recipes based on ingredients you already have. With a clean layout and smart cooking timers, CookSmart makes every meal delicious, efficient, and stress-free.",
    "size": 65,
    "reviews": "9.8K",
    "ratingAvg": 4.5,
    "downloads": "410K",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "/languages.png",
    "title": "LearnLang - Language Learning App",
    "companyName": "EduTech Labs",
    "id": 13,
    "description": "LearnLang is an interactive language-learning platform that makes mastering new languages fun and effective. Practice speaking, reading, and writing with AI-powered tutors. Earn rewards through gamified quizzes and daily streak challenges. Real-life conversation simulations help build confidence. The app tracks your improvement and adjusts lessons accordingly. Whether you’re learning English, Spanish, or Japanese, LearnLang offers a personalized path to fluency — anytime, anywhere.",
    "size": 72,
    "reviews": "22.5K",
    "ratingAvg": 4.6,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 10800 }
    ]
  },
  {
    "image": "/dailynews.webp",
    "title": "DailyNews - Latest Headlines & Updates",
    "companyName": "InfoHub",
    "id": 14,
    "description": "DailyNews is your customizable hub for staying updated with the world. Access breaking news, live updates, and in-depth reports from reliable sources. Tailor your feed by categories like politics, business, sports, or entertainment. Watch short clips, read articles, or listen to audio summaries. The app’s minimalist layout ensures distraction-free reading. DailyNews helps you stay informed, engaged, and aware — no matter where you are.",
    "size": 58,
    "reviews": "33.5K",
    "ratingAvg": 4.1,
    "downloads": "2.6M",
    "ratings": [
      { "name": "1 star", "count": 3200 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 11300 }
    ]
  },
  {
    "image": "/pomocat.webp",
    "title": "PetPal - Pet Care & Community",
    "companyName": "CareCompanions",
    "id": 15,
    "description": "PetPal is the ultimate companion app for pet owners, offering everything you need for pet care and community engagement. Keep track of vaccinations, vet visits, and feeding schedules. Discover nearby pet-friendly parks, stores, and services. Join communities to share experiences and get expert advice. Manage multiple pets with ease through individual profiles. PetPal is not just an organizer — it’s a thriving hub for animal lovers to connect, learn, and care better.",
    "size": 37,
    "reviews": "7.5K",
    "ratingAvg": 4.4,
    "downloads": "290K",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 3400 }
    ]
  },
  {
    "image": "/riding.png",
    "title": "RideGo - Fast & Affordable Rides",
    "companyName": "UrbanMove",
    "id": 16,
    "description": "RideGo simplifies your daily commuting by letting you book rides instantly. Choose from taxis, bikes, or shared rides with transparent fares and estimated times. The app displays driver profiles, live GPS tracking, and secure payment options. Save frequent routes for faster bookings and receive instant notifications on trip status. RideGo ensures safety, reliability, and comfort, making every journey stress-free and efficient.",
    "size": 81,
    "reviews": "29.5K",
    "ratingAvg": 4.3,
    "downloads": "3.8M",
    "ratings": [
      { "name": "1 star", "count": 2600 },
      { "name": "2 star", "count": 3300 },
      { "name": "3 star", "count": 5600 },
      { "name": "4 star", "count": 8500 },
      { "name": "5 star", "count": 9600 }
    ]
  },
  {
    "image": "/drawing.webp",
    "title": "Artify - Digital Drawing & Design",
    "companyName": "Creative Minds",
    "id": 17,
    "description": "Artify empowers creators to unleash their imagination with a professional-grade digital art studio. Access hundreds of customizable brushes, color palettes, and filters. Create sketches, paintings, or illustrations with precision tools optimized for stylus and touch. Save your projects to the cloud and revisit them anytime. Join a creative community to showcase your work and get feedback. Whether you’re a hobbyist or a pro, Artify turns your device into a powerful canvas.",
    "size": 102,
    "reviews": "11.2K",
    "ratingAvg": 4.8,
    "downloads": "670K",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 6900 }
    ]
  },
  {
    "image": "/health-wellness.jpg",
    "title": "HealthTrack - Wellness & Fitness Monitor",
    "companyName": "Wellness Corp",
    "id": 18,
    "description": "HealthTrack is your all-in-one wellness companion designed to monitor and improve your health. It records steps, calories, sleep quality, and heart rate through smart sensors or connected wearables. Visual reports and daily summaries help you understand your habits better. Personalized insights guide you toward healthier lifestyle choices. You can also set reminders for hydration, workouts, and medication. HealthTrack keeps you informed and motivated toward your fitness goals.",
    "size": 59,
    "reviews": "18.8K",
    "ratingAvg": 4.5,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 9400 }
    ]
  },
  {
    "image": "/audiobook.webp",
    "title": "StoryWorld - Books & Audiobooks",
    "companyName": "LitNext",
    "id": 19,
    "description": "StoryWorld opens up a universe of reading and listening experiences through ebooks and audiobooks. Discover stories from every genre — romance, thriller, sci-fi, or non-fiction — curated to your preferences. Save favorites, create collections, and sync your reading progress across devices. Offline mode lets you enjoy stories anywhere. The app also provides personalized recommendations based on your reading habits. StoryWorld transforms how you experience literature in the digital age.",
    "size": 46,
    "reviews": "9.2K",
    "ratingAvg": 4.2,
    "downloads": "520K",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 3700 }
    ]
  },
  {
    "image": "/event-planner.jpg",
    "title": "EventPro - Event Planning Made Easy",
    "companyName": "PlanIt",
    "id": 20,
    "description": "EventPro is your go-to app for planning and managing events effortlessly. From birthday parties to corporate conferences, it streamlines guest lists, invitations, and scheduling. Collaborate with co-hosts in real time and track RSVPs at a glance. The built-in task manager keeps you organized with reminders and deadlines. EventPro ensures every event runs smoothly, helping you focus on creativity and connection instead of logistics.",
    "size": 64,
    "reviews": "13.4K",
    "ratingAvg": 4.3,
    "downloads": "750K",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5200 }
    ]
  }
]
